{
    "experiences": [
        {
            "title": "Graduate Teaching Assistant",
            "subtitle": "Northeastern University",
            "workType": "Part-time",
            "workDescription": [
                "As a Teaching Assistant for CS5008 – Data Structures, Algorithms, and their Applications in Computer Systems, I mentor 90+ students in core concepts of data structures, algorithms, and their applications. I assist with lab work and homework focused on implementing data structures in C and applying algorithmic strategies like divide-and-conquer and dynamic programming. Additionally, I support students in mastering multi-threading, system architecture, and the C compilation process."
            ],
            "dateText": "01/2025 – 04/2025"
        },{
            "title": "Software Development Engineer Co-op",
            "subtitle": "Amazon Robotics",
            "workType": "Full-time",
            "workDescription": [
                "During my tenure at Amazon Robotics, I consistently delivered results by taking full ownership of the end-to-end software development life cycle for my project. I designed high-level documentation, aligning project objectives with stakeholder expectations, and ensured the on-time delivery of time-sensitive tasks while upholding the highest standards in code quality and design. My proactive approach expanded the existing codebase, enhancing vertical scalability and improving the overall user experience. Driven by a passion for continuous improvement, I embraced a learning mindset, diving deep into learning technologies/services such as AWS and Kotlin to further contribute to the team's success."
            ],
            "dateText": "07/2024 – 12/2024"
        },{
            "title": "Software Engineer",
            "subtitle": "TatvaSoft",
            "workType": "Full-time",
            "workDescription": [
                "During my time as a Software Engineer at TatvaSoft, my responsibilities included full stack development of web applications, create and manage the APIs/web services, feature development & optimizations along with the testing and client communication. I handled the development of the frontend, backend, and database management. Additionally, I worked closely with cross-functional teams, mainly the mobile team and web design team."
            ],
            "dateText": "04/2021 – 11/2022"
        },
        {
            "title": "Full Stack Developer",
            "subtitle": "Vaghasiya Enterprise",
            "workType": "Full-time",
            "workDescription": [
                "As a developer for the company, I was involved in creating new features for the company’s desktop application. Additionally, I was part of a team that developed the company’s interview website and auction website, where my responsibilities ranged from requirement gathering to designing, developing, and testing the applications. My major focus was on developing new software architecture that was both user-friendly and efficient."
            ],
            "dateText": "02/2020 – 03/2021"
        }
    ]
}