{
    "projects" : [
        {
            "title": "IME - Image Manipulation and Enhancement",
            "bodyText": "- The application follows a model-view-controller design pattern and is designed to scale well over-time as features add up. \n - The GUI is built using Java swings and use multi-threading for better user-experience. \n - The application offers various filters such as Sepia, Mosaic, Gray-scale, Dither, Sharpen & Blur. \n - The application also allows the user to specify intensity for some of these filters.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/krinadevani/ImageManipulation"
                }
            ],
            "tags" : [
                "Java",
                "Java Swing",
                "JUnit",
                "Design Patterns",
                "Object-Oriented Design",
                "Git",
                "Graphical User Interface"
            ]
        },
        {
            "title": "Kanbas",
            "bodyText": "- The application is a react web application which is a learning management system and digital home base for course, assignments and student details. \n -  It provides multiple pages dedicated to handling various functionalities including assignments, grades, and student profiles.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/krinadevani/kanbas-react-web-app/tree/a3"
                }
            ],
            "tags" : [
                "React",
                "JavaScript",
                "ES6",
                "HTML",
                "CSS",
                "Bootstrap"
            ]
        },
        {
            "title": "Database Mining",
            "bodyText": "- Created a project focused on extracting and storing XML data relationally in SQLite, followed by creating an analytical database using a star schema in MySQL  \n- Analyzed and presented results in an R Notebook, demonstrating proficiency in database design, data extraction, data analysis and analytical reporting",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/krinadevani/Database-Mining"
                }
            ],
            "tags" : [
                "R",
                "MySQL",
                "SQLite",
                "Data Warehouse",
                "RDBMS",
                "XML"
            ]
        },
        {
            "title": "Power Supply management",
            "bodyText": "- I undertook the development of the web application for an e-contract system for a power supply management company during my time at TatvaSoft, encompassing both their admin-side and client-side websites. \n - This project involved implementing various features such as a custom chatbot and integration of document signing, email, and phone verification functionalities.",
            "tags" : [
                "C#",
                ".NET",
                "MVC",
                "REST APIs",
                "SQL Server",
                "JavaScript"
            ]
        },
        {
            "title": "Hospital Management System",
            "bodyText": "- I designed the backend architecture for a healthcare-focused portal, incorporating five distinct workflows tailored to serve patients, primary care providers, labs, radiologists, and pharmacies. \n - Throughout the development process, strict adherence to HIPAA compliance standards was maintained to ensure the confidentiality and security of sensitive patient information.",
            "tags" : [
                "C#",
                "SQL Server"
            ]
        },
        {
            "title": "Order Management Portal",
            "bodyText": "- I developed the web application for an eCommerce portal at TatvaSoft, concentrating on efficiently managing, manipulating, and tracking orders, quotes, and product details. \n - Leveraging robust development frameworks and meticulous attention to detail, the portal offers seamless navigation and functionality. \n - Its user-friendly interface enables easy order management, quote generation, and comprehensive tracking of product details, ensuring a streamlined and satisfying user experience.",
            "tags" : [
                "C#",
                ".NET",
                "Angular JS",
                "Web Services",
                "SQL Server"
            ]
        },
        {
            "title": "Chest-X-ray-Image-Classification",
            "bodyText": "- This project utilizes Convolutional Neural Networks (CNNs) to automate pneumonia detection from chest X-ray images, enhancing diagnostic capabilities and enabling timely medical interventions.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/krinadevani/Chest-X-ray-Image-Classification"
                }
            ],
            "tags" : [
                "Python",
                "VGG16",
                "VGG19",
                "ResNet50"
            ]
        },
        {
            "title": "Bird Strike Data",
            "bodyText": "- I developed a logical data model, created a relational schema, and executed data loading from the FAA's dataset using R. \n - Additionally, I am proficient in SQL queries for data analysis and possess strong troubleshooting skills for programming errors.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/krinadevani/BirdStrikeData"
                }
            ],
            "tags" : [
                "R",
                "MySQL"
            ]
        },
        {
            "title": "Music Recommendation System",
            "bodyText": "- We designed and developed a music recommendation system using various data mining techniques and the Million Song Dataset. \n - It incorporates SVD, content-based filtering, KNN, collaborative filtering, and a popularity-based model for personalized recommendations.",
            "tags" : [
                "Python",
                "Data Mining Techniques"
            ]
        }
    ]
}